WB20600/STM32_2026_SmartFarm_Lower/Hardware_include/y_motor.h
#ifndef __Y_MOTOR_H
#define __Y_MOTOR_H

#include "stm32f4xx.h"
#include "Sys.h"
#include <stdlib.h>

typedef struct
{
    float Kp;
    float Ki;
    float Kd;
    float LastError;
    float LLastError;
    float IntegralOut;
    float Output;
    float IntegralMax;
    float OutputMax;
    float errormax;
    float errormin;
} PID;

extern PID A_SpeedPID;
extern PID B_SpeedPID;
extern PID C_SpeedPID;
extern PID D_SpeedPID;

extern int Z_step;
extern int Y_step;

void PID_Reset(PID *sptr);
float IncPIDCalc(PID *sptr, float Setpoint, float Turepoint, float dt_s);
void PID_int(void);

void MOTOR_A_SetSpeed(int16_t speed);
void MOTOR_B_SetSpeed(int16_t speed);
void MOTOR_C_SetSpeed(int16_t speed);
void MOTOR_D_SetSpeed(int16_t speed);

void MOTOR_A_SetSpeed_Close(float speed, float SpeedA, float dt_s);
void MOTOR_B_SetSpeed_Close(float speed, float SpeedB, float dt_s);
void MOTOR_C_SetSpeed_Close(float speed, float SpeedC, float dt_s);
void MOTOR_D_SetSpeed_Close(float speed, float SpeedD, float dt_s);

void Stepper_Motor_Run_1(int32_t num);
void Stepper_Motor_Run_2(int32_t num);
void Stepper_ON(void);
void Stepper_OFF(void);

#endif
